jcarvalhogo/stm32-lcd-discovery/7inch_RGB_Display_V1.2/1-Demo/Demo_STM32/野火自带F429_V1程序-电容触摸屏—触摸画板（屏幕兼容版，支持FT5426触摸）/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   LTDC-LCD触摸画板
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 STM32  F429开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */
  
#include "stm32f4xx.h"
#include "./led/bsp_led.h"
#include "./usart/bsp_debug_usart.h"
#include "./sdram/bsp_sdram.h"
#include "./lcd/bsp_lcd.h"
#include "./touch/bsp_touch_gtxx.h"
#include "./touch/palette.h"
#include "./touch/bsp_touch_ft5x26.h"

void Delay(__IO u32 nCount); 

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	uint16_t id;
	/* LED 端口初始化 */
	LED_GPIO_Config();	
	
  Debug_USART_Config();    
  printf("\r\n野火STM3F429 触摸画板测试例程\r\n");

//	LED_BLUE;
	/* 初始化触摸屏 */
	id=FT5X26_Read_ID();
	if((id == 0x3003)||(id == 0x0001)||(id == 0x0002))
	{
		FT5X26_Init_Panel(); 
	}
	else
	{
		GTP_Init_Panel(); 
	}
	/*初始化液晶屏*/
  LCD_Init();
  LCD_LayerInit();
  LTDC_Cmd(ENABLE);
	
	/*把背景层刷黑色*/
  LCD_SetLayer(LCD_BACKGROUND_LAYER);  
	LCD_Clear(LCD_COLOR_BLACK);
	
  /*初始化后默认使用前景层*/
	LCD_SetLayer(LCD_FOREGROUND_LAYER); 
	/*默认设置不透明	，该函数参数为不透明度，范围 0-0xff ，0为全透明，0xff为不透明*/
  LCD_SetTransparency(0xFF);
	LCD_Clear(LCD_COLOR_BLACK);
	
	/*调用画板函数*/
	Palette_Init();


  Delay(0xfff);
   

  while(1);
   

}



void Delay(__IO uint32_t nCount)	 //简单的延时函数
{
	for(; nCount != 0; nCount--);
}
/*********************************************END OF FILE**********************/

